<?php
//首页
$hide=$_REQUEST["hide"];
if($hide==0){
    echo '[
        {
            "name":"重庆"
        },
        {
            "name":"成都"
        },
        {
            "name":"上海"
        },
        {
            "name":"北京"
        },
        {
            "name":"广州"
        },
        {
            "name":"深圳"
        },
    ]';
}else if($hide==1){
    echo '[
        {
            "src":"a7.jpg"，
            "name":"工程师多"，
            "com":"超过20000名维修工程师，域覆盖全国80%县级以上城"
        },
        {
            "src":"a8.jpg",
            "name":"技术好",
            "com":"工程师背景调查严筛，全方面岗前培训与考核，提供专业级别服务"
        },
        {
            "src":"A9.jpg"，
            "name":"服务广",
            "com":"400多种维保服务，含家电、装修、水电等，一站解决所有家居问题"
        },
        {
            "src":"A10.jpg"，
            "name":"价格透明",
            "com":"线上全透明标准定价，为您提供标准的价格清单"
        },
        {
            "src":"A11.jpg"，
            "name":"服务准时",
            "com":"按预定或沟通达成一致的时间准时上门服务"
        },
        {
            "src":"A12.jpg"，
            "name":"诚信守诺",
            "com":"按章承诺，有诺必履行"
        },
    ]';
}else if($hide==2){
    echo '[
        {
            "src":"A13.png",
            "name":"家电维修",
            "com":"维修范围包括常用家电、厨房电器、生活电器等，以用户需求为核心，提供极致的服务体验",
        },
        {
            "src":"A14.png",
            "name":"家电清洗",
            "com":"一键下单，按约上门，选择啄木鸟，轻松完成一整套清洗、清洁服务"
        },
        {
            "src":"A15.png",
            "name":"家电安装",
            "com":"安装空调、洗衣机、热水器、油烟机等电器,专业规范的操作，便捷舒适更放心。"
        },
        {
            "src":"A16.png",
            "name":"房屋修缮",
            "com":"专业房屋修缮，正规，可靠，让您明明白白消费，啄木鸟为您的家庭维保护航。"
        },
        {
            "src":"A17.png",
            "name":"管道疏通",
            "com":"服务范围包含下水道堵塞、马桶堵塞、地漏堵塞疏通等项目，专业贴心。"
        },
        {
            "src":"A18.png",
            "name":"水电维修",
            "com":"电路灯具维修、水管管路维修、卫浴洁具维修、五金挂件维修"
        },
        {
            "src":"A19.png",
            "name":"开锁换锁",
            "com":"安全放心，价格透明，服务质量品质保证。"
        },
        {
            "src":"A20.jpg",
            "name":"家电门窗",
            "com":"维修范围包含沙发、桌椅、门窗等，一键下单，轻松应该维修烦恼。"
        },
    ]';
}else if($hide==3){
    echo '[
        {
            "name":"段大爷",
            "op":"油烟机清洗服务",
            "sc":"太棒了，服务太好了，必须给师傅和售后点个赞，和新的一模一样，已经8年的机器了，现在返老还童了哈哈"
        },
        {
            "name":"张先生",
            "op":"油烟机清洗服务",
            "sc":"停产很多年的老式油烟机，配件都已经找不到了，非常感谢黄师傅帮忙改造代用件，油烟机又能正常工作了。"
        },
        {
            "name":"匿名用户",
            "op":"空调清洗服务",
            "sc":"上门师傅服务很好，比较老的大2匹挂机，第一次上门时外罩偏小，预约后再次上门，花了近一个半小时认真清洗，值得肯定。"
        },
        {
            "name":"王女士",
            "op":"电视机维修",
            "sc":"液晶电视电路出了问题，让师傅来修很快就修好了，价格也还可以。"
        },
        {
            "name":"张老师",
            "op":"冰箱维修",
            "sc":"陈师傅技术不错 修好后还交代一下后期如何操作 以及保养"
        },
        {
            "name":"唐先生",
            "op":"热水器清洗服务",
            "sc":"洗的确实还多干净"
        },
        {
            "name":"匿名用户",
            "op":"油烟机清洗服务",
            "sc":"太棒了，服务太好了，必须给师傅和售后点个赞，和新的一模一样，已经8年的机器了，现在返老还童了哈哈"
        },
        {
            "name":"段大爷",
            "op":"油烟机清洗服务",
            "sc":"太棒了，服务太好了，必须给师傅和售后点个赞，和新的一模一样，已经8年的机器了，现在返老还童了哈哈"
        },
        {
            "name":"张先生",
            "op":"油烟机清洗服务",
            "sc":"停产很多年的老式油烟机，配件都已经找不到了，非常感谢黄师傅帮忙改造代用件，油烟机又能正常工作了。"
        },
        {
            "name":"匿名用户",
            "op":"空调清洗服务",
            "sc":"上门师傅服务很好，比较老的大2匹挂机，第一次上门时外罩偏小，预约后再次上门，花了近一个半小时认真清洗，值得肯定。"
        },
        {
            "name":"王女士",
            "op":"电视机维修",
            "sc":"液晶电视电路出了问题，让师傅来修很快就修好了，价格也还可以。"
        },
        {
            "name":"张老师",
            "op":"冰箱维修",
            "sc":"陈师傅技术不错 修好后还交代一下后期如何操作 以及保养"
        },
        {
            "name":"唐先生",
            "op":"热水器清洗服务",
            "sc":"洗的确实还多干净"
        },
        {
            "name":"匿名用户",
            "op":"油烟机清洗服务",
            "sc":"太棒了，服务太好了，必须给师傅和售后点个赞，和新的一模一样，已经8年的机器了，现在返老还童了哈哈"
        },
    ]';
}else if($hide==4){
    echo '[
        {
            "src":"A31.png"
        },
        {
            "src":"A32.jpg"
        },
        {
            "src":"A33.jpg"
        },
        {
            "src":"A34.jpg"
        },
        {
            "src":"A35.png"
        },
        {
            "src":"A36.png"
        },
        {
            "src":"A37.png"
        },
        {
            "src":"A38.png"
        },
        {
            "src":"A39.jpg"
        },
        {
            "src":"A40.png"
        },
        {
            "src":"A41.png"
        },
        {
            "src":"A42.png"
        },
    ]';
//专业维修

}else if($hide==5){
    echo '[
        {
        "src":"b3.jpg",
        "name":"身份验证",
        "com":"我们100%对每一位服务工程师进行身份验证确保为您服务的人员信息真实可靠"
        },
        {
        "src":"b4.jpg",
        "name":"背景调查",
        "com":"我们对每一位服务工程师过往是否有犯罪记录进行调查，严格确保人员的正规化"
        },
         {
        "src":"b5.jpg",
        "name":"岗前培训",
        "com":"通过筛选择优录取的服务工程师，还要经过流程规范、服务规范及价格体系的培训，培训考试合格后才可正式接单"
         },
        {
        "src":"b6.jpg",
        "name":"多重监管",
        "com":"技工平台净化系统，内部等级评价制度、用户使用服务点评制度等多重监管体系，确保服务质量"
        },
        {
        "src":"b7.jpg",
        "name":"商业保险",
        "com":"我们对每一个签约服务工程师购买了商业保险，确保服务人员在服务过程中的人身及财产安全"
        },
        {
    ]'
//服务分类
}else if($hide==6){
    echo '[
        {
            "name":"三洋洗衣机教程",
            "com":"三洋洗衣机教程：1、保证电源和水源开了后，将衣服放进滚筒洗衣机里。2、打开放洗涤剂的盒子，会看见有三个格子，将洗涤剂放在第一个专门放洗涤剂的盒子里。3、放好衣物以及关好门后，选择你想要的洗涤模式，不用管它，洗衣机时间到了就自动停止了。",
            "time":"2020-12-21",
            "icon":"洗衣机 洗衣机使用"
        },
        {
            "name":"电磁炉加热停一下滴滴响",
            "com":"电磁炉加热停一下滴滴响:（1）热开关坏/热敏电阻坏，主控IC坏换/热开关/热敏电阻/主控IC。（2）振荡子坏，变压器坏换振荡子，检查或更换变压器。（3）基板组件坏　检查或更换基板组件。",
            "time":"2020-12-21",
            "icon1":"电磁炉",
            "icon2":"电磁炉故障"
        },
        {
            "name":"网络邻居发现不了对方电脑",
            "com":"网络邻居发现不了对方电脑：确保你的本地连接属性中，已经添加了microsoft网络的文件和打印机共享组件；确保共享的计算机ip地址设置正确，IP是否处在同一局域网网段中；打开控制面板管理工具服务。看一下 Server 服务是否已经启动。",
            "time":"2020-12-21",
            "icon1":"电脑故障",
            "icon2":"电脑维修"
        },
        {
            "name":"小米打印机怎么连接电脑",
            "com":"小米打印机怎么连接电脑：在桌面进入“设备”选项。在左侧选择“打印机和扫描仪”子菜单。点击“+”号按钮添加打印机或扫描仪。等待系统搜索打印机的编号进行连接。同样可以点击添加蓝牙设备无线连接打印机。选择“其他所有设备”进行添加。",
            "time":"2020-12-21",
            "icon1":"电脑故障",
            "icon2":"电脑维修"
        },
        {
            "name":"三洋洗衣机教程",
            "com":"三洋洗衣机教程：1、保证电源和水源开了后，将衣服放进滚筒洗衣机里。2、打开放洗涤剂的盒子，会看见有三个格子，将洗涤剂放在第一个专门放洗涤剂的盒子里。3、放好衣物以及关好门后，选择你想要的洗涤模式，不用管它，洗衣机时间到了就自动停止了。",
            "time":"2020-12-21",
            "icon":"洗衣机 洗衣机使用"
        },
        {
            "name":"电磁炉加热停一下滴滴响",
            "com":"电磁炉加热停一下滴滴响:（1）热开关坏/热敏电阻坏，主控IC坏换/热开关/热敏电阻/主控IC。（2）振荡子坏，变压器坏换振荡子，检查或更换变压器。（3）基板组件坏　检查或更换基板组件。",
            "time":"2020-12-21",
            "icon1":"电磁炉",
            "icon2":"电磁炉故障"
        },
        {
            "name":"网络邻居发现不了对方电脑",
            "com":"网络邻居发现不了对方电脑：确保你的本地连接属性中，已经添加了microsoft网络的文件和打印机共享组件；确保共享的计算机ip地址设置正确，IP是否处在同一局域网网段中；打开控制面板管理工具服务。看一下 Server 服务是否已经启动。",
            "time":"2020-12-21",
            "icon1":"电脑故障",
            "icon2":"电脑维修"
        },
        {
            "name":"小米打印机怎么连接电脑",
            "com":"小米打印机怎么连接电脑：在桌面进入“设备”选项。在左侧选择“打印机和扫描仪”子菜单。点击“+”号按钮添加打印机或扫描仪。等待系统搜索打印机的编号进行连接。同样可以点击添加蓝牙设备无线连接打印机。选择“其他所有设备”进行添加。",
            "time":"2020-12-21",
            "icon1":"电脑故障",
            "icon2":"电脑维修"
        },
        {
            "name":"三洋洗衣机教程",
            "com":"三洋洗衣机教程：1、保证电源和水源开了后，将衣服放进滚筒洗衣机里。2、打开放洗涤剂的盒子，会看见有三个格子，将洗涤剂放在第一个专门放洗涤剂的盒子里。3、放好衣物以及关好门后，选择你想要的洗涤模式，不用管它，洗衣机时间到了就自动停止了。",
            "time":"2020-12-21",
            "icon":"洗衣机 洗衣机使用"
        },
        {
            "name":"电磁炉加热停一下滴滴响",
            "com":"电磁炉加热停一下滴滴响:（1）热开关坏/热敏电阻坏，主控IC坏换/热开关/热敏电阻/主控IC。（2）振荡子坏，变压器坏换振荡子，检查或更换变压器。（3）基板组件坏　检查或更换基板组件。",
            "time":"2020-12-21",
            "icon1":"电磁炉",
            "icon2":"电磁炉故障"
        },
        {
            "name":"网络邻居发现不了对方电脑",
            "com":"网络邻居发现不了对方电脑：确保你的本地连接属性中，已经添加了microsoft网络的文件和打印机共享组件；确保共享的计算机ip地址设置正确，IP是否处在同一局域网网段中；打开控制面板管理工具服务。看一下 Server 服务是否已经启动。",
            "time":"2020-12-21",
            "icon1":"电脑故障",
            "icon2":"电脑维修"
        },
        {
            "name":"小米打印机怎么连接电脑",
            "com":"小米打印机怎么连接电脑：在桌面进入“设备”选项。在左侧选择“打印机和扫描仪”子菜单。点击“+”号按钮添加打印机或扫描仪。等待系统搜索打印机的编号进行连接。同样可以点击添加蓝牙设备无线连接打印机。选择“其他所有设备”进行添加。",
            "time":"2020-12-21",
            "icon1":"电脑故障",
            "icon2":"电脑维修"
        },
        {
            "name":"三洋洗衣机教程",
            "com":"三洋洗衣机教程：1、保证电源和水源开了后，将衣服放进滚筒洗衣机里。2、打开放洗涤剂的盒子，会看见有三个格子，将洗涤剂放在第一个专门放洗涤剂的盒子里。3、放好衣物以及关好门后，选择你想要的洗涤模式，不用管它，洗衣机时间到了就自动停止了。",
            "time":"2020-12-21",
            "icon":"洗衣机 洗衣机使用"
        },
        {
            "name":"电磁炉加热停一下滴滴响",
            "com":"电磁炉加热停一下滴滴响:（1）热开关坏/热敏电阻坏，主控IC坏换/热开关/热敏电阻/主控IC。（2）振荡子坏，变压器坏换振荡子，检查或更换变压器。（3）基板组件坏　检查或更换基板组件。",
            "time":"2020-12-21",
            "icon1":"电磁炉",
            "icon2":"电磁炉故障"
        },
        {
            "name":"网络邻居发现不了对方电脑",
            "com":"网络邻居发现不了对方电脑：确保你的本地连接属性中，已经添加了microsoft网络的文件和打印机共享组件；确保共享的计算机ip地址设置正确，IP是否处在同一局域网网段中；打开控制面板管理工具服务。看一下 Server 服务是否已经启动。",
            "time":"2020-12-21",
            "icon1":"电脑故障",
            "icon2":"电脑维修"
        },
        {
            "name":"小米打印机怎么连接电脑",
            "com":"小米打印机怎么连接电脑：在桌面进入“设备”选项。在左侧选择“打印机和扫描仪”子菜单。点击“+”号按钮添加打印机或扫描仪。等待系统搜索打印机的编号进行连接。同样可以点击添加蓝牙设备无线连接打印机。选择“其他所有设备”进行添加。",
            "time":"2020-12-21",
            "icon1":"电脑故障",
            "icon2":"电脑维修"
        },
            
    ]'
}else if($hide==7){
    echo '[
        {
            "name":"“计价器先行·品质战共赢”啄木鸟维修计价器全国动员会正式召开",
            "com":"2020年12月15日14时，啄木鸟总公司高管、27家子公司总经理以及计价器项目组相关负责人于啄木鸟网络科技有限公司重庆总部正式启“计价器先行·品质战共赢”全国动员会。据悉，啄木鸟维修计价器即将于12月21日正式上线。",
            "time":"2020-12-21",
            "icon1":"计价器",
            "icon2":"",
            "src":"E2.jpg"
        },
        {
            "name":"两江新区管委会副主任秦淑斌一行调研啄木鸟：打造工匠精神，推行行业标准",
            "com":"两江新区党工委委员、管委会副主任秦淑斌、重庆两江新区管委会现代服务业局副局长谭杰予、产业集团渝兴公司总经理马利树一行调研重庆啄木鸟网络科技有限公司",
            "time":"2020-12-04",
            "icon1":"两江新区",
            "icon2":"秦淑斌",
            "src":"E3.jpg"
        },
        {
            "name":"空调加氟收费标准是什么?",
            "com":"说起空调加氟大家都很熟悉的，家里几乎都装有空调，而空调使用了一段时间后都是需要加氟的，这样才可以保证其正常使用，但是在加氟过程中有一个问题，就是空调加氟收费的问题，这是我们都非常关注的，很多人就被骗过，那么空调加氟收费标准一般是怎样的呢",
            "time":"2020-12-01",
            "icon1":"空调加氟标准",
            "icon2":"",
            "src":"E4.jpg"
        },
        {
            "name":"电视机自动关机怎么解决",
            "com":"以前有句老话是秀才不出门，便知天下事，这句话的意思是读书人是可以通过读书，来知道世界各处的事情。现在我们则是可以通过电视机来全面的了解全球各地的新鲜事情。电视机的使用在我们现在的家庭里面可以说是特别多的，在电视机使用的时候也很有可能是会出现故障的，比如说电视机老是自动关机，那么，在电视机自动关机的时候，我们应该怎么办呢？",
            "time":"2020-11-19",
            "icon1":"电视维修",
            "icon2":"电视故障",
            "src":"E4.jpg"
        },
        {
            "name":"海信智能电视好不好",
            "com":" 家在购买电视机的时候，为了能够有一个更方便的操控和更好的观看体验，很多人都会选择最新的智能电视机产品。智能电视机是现在最好用的一种电视机产品，比起传统的电视机来说有着更多的优势，海信智能电视是一款很不错的智能电视机品牌，很多的消费者都对这款品牌的电视机不陌生，所以小编今天就来为大家介绍下关于海信智能电视的一些产品情况，帮助大家更好的进行选购和使用海信智能电视。",
            "time":"2020-11-19",
            "icon1":"电视维修",
            "icon2":"电视故障",
            "src":"E4.jpg"
        },
        {
            "name":"海信电视花屏故障怎么办",
            "com":"电视现在是家家户户都很常见的家电设备。人们几乎在装修房子的时候，一定会购买这个家电。也有的老百姓为了庆祝亲戚朋友的乔迁之喜，就会送电视或者冰箱给户主。",
            "time":"2020-11-19",
            "icon1":"电视维修",
            "icon2":"电视故障",
            "src":"E4.jpg"
        },
        {
            "name":"“计价器先行·品质战共赢”啄木鸟维修计价器全国动员会正式召开",
            "com":"2020年12月15日14时，啄木鸟总公司高管、27家子公司总经理以及计价器项目组相关负责人于啄木鸟网络科技有限公司重庆总部正式启“计价器先行·品质战共赢”全国动员会。据悉，啄木鸟维修计价器即将于12月21日正式上线。",
            "time":"2020-12-21",
            "icon1":"计价器",
            "icon2":"",
            "src":"E2.jpg"
        },
        {
            "name":"两江新区管委会副主任秦淑斌一行调研啄木鸟：打造工匠精神，推行行业标准",
            "com":"两江新区党工委委员、管委会副主任秦淑斌、重庆两江新区管委会现代服务业局副局长谭杰予、产业集团渝兴公司总经理马利树一行调研重庆啄木鸟网络科技有限公司",
            "time":"2020-12-04",
            "icon1":"两江新区",
            "icon2":"秦淑斌",
            "src":"E3.jpg"
        },
        {
            "name":"空调加氟收费标准是什么?",
            "com":"说起空调加氟大家都很熟悉的，家里几乎都装有空调，而空调使用了一段时间后都是需要加氟的，这样才可以保证其正常使用，但是在加氟过程中有一个问题，就是空调加氟收费的问题，这是我们都非常关注的，很多人就被骗过，那么空调加氟收费标准一般是怎样的呢",
            "time":"2020-12-01",
            "icon1":"空调加氟标准",
            "icon2":"",
            "src":"E4.jpg"
        },
        {
            "name":"电视机自动关机怎么解决",
            "com":"以前有句老话是秀才不出门，便知天下事，这句话的意思是读书人是可以通过读书，来知道世界各处的事情。现在我们则是可以通过电视机来全面的了解全球各地的新鲜事情。电视机的使用在我们现在的家庭里面可以说是特别多的，在电视机使用的时候也很有可能是会出现故障的，比如说电视机老是自动关机，那么，在电视机自动关机的时候，我们应该怎么办呢？",
            "time":"2020-11-19",
            "icon1":"电视维修",
            "icon2":"电视故障",
            "src":"E4.jpg"
        },
        {
            "name":"海信智能电视好不好",
            "com":" 家在购买电视机的时候，为了能够有一个更方便的操控和更好的观看体验，很多人都会选择最新的智能电视机产品。智能电视机是现在最好用的一种电视机产品，比起传统的电视机来说有着更多的优势，海信智能电视是一款很不错的智能电视机品牌，很多的消费者都对这款品牌的电视机不陌生，所以小编今天就来为大家介绍下关于海信智能电视的一些产品情况，帮助大家更好的进行选购和使用海信智能电视。",
            "time":"2020-11-19",
            "icon1":"电视维修",
            "icon2":"电视故障",
            "src":"E4.jpg"
        },
        {
            "name":"海信电视花屏故障怎么办",
            "com":"电视现在是家家户户都很常见的家电设备。人们几乎在装修房子的时候，一定会购买这个家电。也有的老百姓为了庆祝亲戚朋友的乔迁之喜，就会送电视或者冰箱给户主。",
            "time":"2020-11-19",
            "icon1":"电视维修",
            "icon2":"电视故障",
            "src":"E4.jpg"
        },
        {
            "name":"“计价器先行·品质战共赢”啄木鸟维修计价器全国动员会正式召开",
            "com":"2020年12月15日14时，啄木鸟总公司高管、27家子公司总经理以及计价器项目组相关负责人于啄木鸟网络科技有限公司重庆总部正式启“计价器先行·品质战共赢”全国动员会。据悉，啄木鸟维修计价器即将于12月21日正式上线。",
            "time":"2020-12-21",
            "icon1":"计价器",
            "icon2":"",
            "src":"E2.jpg"
        },
        {
            "name":"两江新区管委会副主任秦淑斌一行调研啄木鸟：打造工匠精神，推行行业标准",
            "com":"两江新区党工委委员、管委会副主任秦淑斌、重庆两江新区管委会现代服务业局副局长谭杰予、产业集团渝兴公司总经理马利树一行调研重庆啄木鸟网络科技有限公司",
            "time":"2020-12-04",
            "icon1":"两江新区",
            "icon2":"秦淑斌",
            "src":"E3.jpg"
        },
        {
            "name":"空调加氟收费标准是什么?",
            "com":"说起空调加氟大家都很熟悉的，家里几乎都装有空调，而空调使用了一段时间后都是需要加氟的，这样才可以保证其正常使用，但是在加氟过程中有一个问题，就是空调加氟收费的问题，这是我们都非常关注的，很多人就被骗过，那么空调加氟收费标准一般是怎样的呢",
            "time":"2020-12-01",
            "icon1":"空调加氟标准",
            "icon2":"",
            "src":"E4.jpg"
        },
        {
            "name":"电视机自动关机怎么解决",
            "com":"以前有句老话是秀才不出门，便知天下事，这句话的意思是读书人是可以通过读书，来知道世界各处的事情。现在我们则是可以通过电视机来全面的了解全球各地的新鲜事情。电视机的使用在我们现在的家庭里面可以说是特别多的，在电视机使用的时候也很有可能是会出现故障的，比如说电视机老是自动关机，那么，在电视机自动关机的时候，我们应该怎么办呢？",
            "time":"2020-11-19",
            "icon1":"电视维修",
            "icon2":"电视故障",
            "src":"E4.jpg"
        },
        {
            "name":"海信智能电视好不好",
            "com":" 家在购买电视机的时候，为了能够有一个更方便的操控和更好的观看体验，很多人都会选择最新的智能电视机产品。智能电视机是现在最好用的一种电视机产品，比起传统的电视机来说有着更多的优势，海信智能电视是一款很不错的智能电视机品牌，很多的消费者都对这款品牌的电视机不陌生，所以小编今天就来为大家介绍下关于海信智能电视的一些产品情况，帮助大家更好的进行选购和使用海信智能电视。",
            "time":"2020-11-19",
            "icon1":"电视维修",
            "icon2":"电视故障",
            "src":"E4.jpg"
        },
        {
            "name":"海信电视花屏故障怎么办",
            "com":"电视现在是家家户户都很常见的家电设备。人们几乎在装修房子的时候，一定会购买这个家电。也有的老百姓为了庆祝亲戚朋友的乔迁之喜，就会送电视或者冰箱给户主。",
            "time":"2020-11-19",
            "icon1":"电视维修",
            "icon2":"电视故障",
            "src":"E4.jpg"
        },
    ]'
}else if($hide==8){
    echo '[]'
}else if($hide==9){
    echo '[]'
}else if($hide==10){
    echo '[]'
}else if($hide==11){
    echo '[]'
}else if($hide==12){
    echo '[]'
}else if($hide==13){
    echo '[]'
}else if($hide==14){
    echo '[]'
}else if($hide==15){
    echo '[]'
}else if($hide==16){
    echo '[]'
}
?>